local cfg = require "cfg._cfgs"

---@class cfg.ai.ai_action
---@field iD number , ID
---@field desc string , 描述
---@field formulaID number , 公式
---@field argIList table<number,number> , 参数(int)1
---@field argSList table<number,number> , 参数(string)1
---@field get fun(ID:number):cfg.ai.ai_action
---@field all table<any,cfg.ai.ai_action>

local this = cfg.ai.ai_action

local mk = cfg._mk.table(this, { { 'all', 'get', 1 }, }, nil, nil, 
    'iD', -- int, ID
    'desc', -- string, 描述
    'formulaID', -- int, 公式
    'argIList', -- list,int,6, 参数(int)1
    'argSList' -- list,int,3, 参数(string)1
    )

local E = cfg._mk.E
local R = cfg._mk.R

local A = {}
A[1] = R({1017001, 1})
A[2] = R({20020})

mk(1, "加载Buff", 1, R({103}), E)
mk(2, "释放技能", 2, R({10002, 0}), E)
mk(10012, "召唤猴子", 2, R({10012, 1}), E)
mk(10013, "召唤猩猩", 2, R({10013, 1}), E)
mk(10015, "召唤猩猩", 2, R({10015, 1}), E)
mk(10017, "召唤猴子", 2, R({10017, 1}), E)
mk(10018, "不消失用", 2, R({10022}), E)
mk(10021, "召唤哥布林", 2, R({10038, 1}), E)
mk(1017001, "1级蘑菇兵自爆", 2, A[1], E)
mk(1017002, "2级蘑菇兵自爆", 2, R({1017002, 1}), E)
mk(1017003, "3级蘑菇兵自爆", 2, R({1017003, 1}), E)
mk(1017004, "4级蘑菇兵自爆", 2, R({1017004, 1}), E)
mk(1017005, "5级蘑菇兵自爆", 2, R({1017005, 1}), E)
mk(1017006, "6级蘑菇兵自爆", 2, R({1017006, 1}), E)
mk(1017007, "为自己加buff", 1, R({1017007}), E)
mk(1018001, "1级阿努比斯自爆", 2, R({1018001, 1}), E)
mk(1018002, "2级阿努比斯自爆", 2, R({1018002, 1}), E)
mk(1018003, "3级阿努比斯自爆", 2, R({1018003, 1}), E)
mk(1018004, "4级阿努比斯自爆", 2, R({1018004, 1}), E)
mk(1018005, "5级阿努比斯自爆", 2, R({1018005, 1}), E)
mk(1018006, "6级阿努比斯自爆", 2, R({1018006, 1}), E)
mk(1030001, "1级野猪怪自爆", 2, R({1030001, 1}), E)
mk(1030002, "2级野猪怪自爆", 2, R({1030002, 1}), E)
mk(1030003, "3级野猪怪自爆", 2, R({1030003, 1}), E)
mk(1030004, "4级野猪怪自爆", 2, R({1030004, 1}), E)
mk(1030005, "5级野猪怪自爆", 2, R({1030005, 1}), E)
mk(1030006, "6级野猪怪自爆", 2, R({1030006, 1}), E)
mk(1071001, "1级鲨鱼怪自爆", 2, R({1071001, 1}), E)
mk(1071002, "2级鲨鱼怪自爆", 2, R({1071002, 1}), E)
mk(1071003, "3级鲨鱼怪自爆", 2, R({1071003, 1}), E)
mk(1071004, "4级鲨鱼怪自爆", 2, R({1071004, 1}), E)
mk(1071005, "5级鲨鱼怪自爆", 2, R({1071005, 1}), E)
mk(1071006, "6级鲨鱼怪自爆", 2, R({1071006, 1}), E)
mk(10019, "新手关塔减伤", 1, R({10019}), E)
mk(5003001, "召唤猴子", 2, R({5003001, 1}), E)
mk(5003002, "召唤猩猩", 2, R({5003002, 1}), E)
mk(5003, "", 2, R({5003005, 1}), E)
mk(1003001, "召唤雪怪", 2, R({10024, 1}), E)
mk(1003002, "召唤哥布林", 2, R({10026, 1}), E)
mk(5004001, "", 2, R({5004001, 0}), E)
mk(10020, "召唤猩猩", 2, R({10033, 1}), E)
mk(1068001, "召唤猴子", 2, R({1068001, 1}), E)
mk(200601, "自毁", 2, A[1], E)
mk(1020, "召唤猩猩", 2, R({102003, 1}), E)
mk(1071013, "召唤炮塔怪物（目前是猩猩）", 2, R({1071113, 1}), E)
mk(1071014, "召唤箭塔怪物（目前是猴子）", 2, R({1071114, 1}), E)
mk(103011, "野猪屏蔽减速buff", 1, R({800111}), E)
mk(20801, "召唤猩猩", 2, R({20080, 1}), E)
mk(20017, "出生后3秒自爆", 2, R({2001721, 1}), E)
mk(20020, "自杀", 1, A[2], E)
mk(20021, "召唤蜘蛛", 2, R({2001722, 1}), E)
mk(20002, "小鸡出生buff", 1, R({20002}), E)
mk(200201, "自杀", 1, A[2], E)

return this
